index=windows source="WinEventLog:Security" EventCode=4688 
(ProcessName="*\\AppData\\Local\\Temp\\*" OR ProcessName="*\\Windows\\Temp\\*")
| stats count by Computer, User, ProcessName, CommandLine
